'''
누구나 파이썬 기초통계(타니아이 히로키, 한빛아카데미)
24페이지
'''


# 변수는 크게 질적 변수와 양적 변수가 있음
# 질적 변수는 만족도 조사에서 처럼 만족도를 선택하거나 혈액형 등 종류를 구별하기 위해 쓰이는 변수를 말함
# 그리고 남성과 여성, 흡연 여부 등 2개뿐인 질적 변수를 2진변수라고 부른다.
# 남자와 여자를 구분하기 위해 0과 1로 구분해서 사용될 때가 많은데, 데이터 값이 숫자라해서 모든 것이 양적변수라고 하지 않음
# 신장이나 시험 점수와 같이 양을 표현해야 하는 것을 양적변수라고 함

# 질적 변수에는 명의 척도, 순서 척도가 있고 양적 변수에는 간격 척도와 비례 척도가 있음(이 네가지를 척도 수준이라고 함)

# 명의 척도 -> 단순 분류를 위한 변수(전화번호, 성별 등)
# 순서 척도 -> 순서관계나 대소 관계가 의미가 있는 변수(순위, 만족도 등)
# 간격 척도 -> 대소 관계와 함께 그 차이에도 의미가 있는 것(온도, 연도 등)
# 비례 척도 -> 대소 관계, 차이, 비(ratio) 모두에 의미가 있는 변수(길이, 무게 등) 

'''
= 척도 수준 정리 =

척도        예시     대소 관계   차이   비
명의 척도  학생 번호      X       X    X
순서 척도  성적 순위      O       X    X
간격 척도    온도        O       O    X
비례 척도    신장        O       O    O
'''


# 이산형 변수 -> 0, 1, 2,.... 와 같이 하나하나의 값을 취하는 변수, 인접한 숫자 사이에 값이 존재하지 않음 주사위 눈값은 중간값을 취하지 않음
# 연속형 변수 -> 연속적인 값을 취할 수 있는 변수 두 숫자 사이에 반드시 숫자 존재함, 길이나 무게, 시간 등은 대표적 연속형 변수

